experiment/results/compare_low_RPS/with_istio_20260101_022222/wrk_logs/wrk_300rps_rep1.log
Running 2m test @ http://192.168.49.2:30918
  4 threads and 100 connections

  Thread calibration: mean lat.: 158.308ms, rate sampling interval: 908ms
  Thread calibration: mean lat.: 164.582ms, rate sampling interval: 908ms
  Thread calibration: mean lat.: 141.739ms, rate sampling interval: 850ms
  Thread calibration: mean lat.: 163.051ms, rate sampling interval: 879ms

-----------------------------------------------------------------------
Test Results @ http://192.168.49.2:30918 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency   171.05ms  220.76ms 945.15ms   85.41%
    Req/Sec    74.14      9.89    97.00     71.94%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   36.70ms
 75.000%  277.50ms
 90.000%  466.43ms
 99.000%  945.15ms
 99.900%    1.51s 
 99.990%    1.86s 
 99.999%    1.96s 
100.000%    1.96s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       2.579     0.000000            1         1.00
       6.143     0.100000         2392         1.11
       7.899     0.200000         4772         1.25
      12.711     0.300000         7159         1.43
      17.791     0.400000         9547         1.67
      36.703     0.500000        11927         2.00
     119.551     0.550000        13120         2.22
     170.367     0.600000        14316         2.50
     202.111     0.650000        15507         2.86
     236.159     0.700000        16699         3.33
     277.503     0.750000        17892         4.00
     301.311     0.775000        18491         4.44
     327.679     0.800000        19084         5.00
     356.351     0.825000        19680         5.71
     387.071     0.850000        20284         6.67
     422.399     0.875000        20876         8.00
     443.903     0.887500        21170         8.89
     466.431     0.900000        21470        10.00
     490.239     0.912500        21767        11.43
     518.399     0.925000        22067        13.33
     550.911     0.937500        22366        16.00
     568.831     0.943750        22518        17.78
     589.823     0.950000        22663        20.00
     615.423     0.956250        22812        22.86
     641.023     0.962500        22959        26.67
     683.007     0.968750        23108        32.00
     703.487     0.971875        23184        35.56
     726.527     0.975000        23257        40.00
     756.223     0.978125        23332        45.71
     795.647     0.981250        23406        53.33
     844.287     0.984375        23481        64.00
     873.471     0.985938        23518        71.11
     900.095     0.987500        23555        80.00
     927.743     0.989062        23593        91.43
     962.559     0.990625        23630       106.67
    1011.711     0.992188        23667       128.00
    1037.823     0.992969        23686       142.22
    1067.007     0.993750        23704       160.00
    1103.871     0.994531        23724       182.86
    1151.999     0.995313        23742       213.33
    1211.391     0.996094        23761       256.00
    1229.823     0.996484        23770       284.44
    1259.519     0.996875        23779       320.00
    1300.479     0.997266        23788       365.71
    1333.247     0.997656        23798       426.67
    1362.943     0.998047        23807       512.00
    1398.783     0.998242        23812       568.89
    1426.431     0.998437        23816       640.00
    1455.103     0.998633        23821       731.43
    1495.039     0.998828        23826       853.33
    1510.399     0.999023        23830      1024.00
    1522.687     0.999121        23833      1137.78
    1537.023     0.999219        23835      1280.00
    1552.383     0.999316        23837      1462.86
    1575.935     0.999414        23840      1706.67
    1591.295     0.999512        23842      2048.00
    1605.631     0.999561        23843      2275.56
    1633.279     0.999609        23844      2560.00
    1640.447     0.999658        23845      2925.71
    1744.895     0.999707        23847      3413.33
    1750.015     0.999756        23848      4096.00
    1750.015     0.999780        23848      4551.11
    1800.191     0.999805        23849      5120.00
    1800.191     0.999829        23849      5851.43
    1830.911     0.999854        23850      6826.67
    1858.559     0.999878        23851      8192.00
    1858.559     0.999890        23851      9102.22
    1858.559     0.999902        23851     10240.00
    1858.559     0.999915        23851     11702.86
    1930.239     0.999927        23852     13653.33
    1930.239     0.999939        23852     16384.00
    1930.239     0.999945        23852     18204.44
    1930.239     0.999951        23852     20480.00
    1930.239     0.999957        23852     23405.71
    1960.959     0.999963        23853     27306.67
    1960.959     1.000000        23853          inf
#[Mean    =      171.045, StdDeviation   =      220.758]
#[Max     =     1959.936, Total count    =        23853]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  26801 requests in 1.50m, 24.08MB read
  Socket errors: connect 0, read 0, write 0, timeout 14
Requests/sec:    297.70  
Transfer/sec:    273.90KB