experiment/results/compare_low_RPS/with_istio_20260101_022222/wrk_logs/wrk_600rps_rep1.log
Running 2m test @ http://192.168.49.2:30918
  4 threads and 100 connections

  Thread calibration: mean lat.: 1119.888ms, rate sampling interval: 4833ms
  Thread calibration: mean lat.: 1348.803ms, rate sampling interval: 6000ms
  Thread calibration: mean lat.: 1322.749ms, rate sampling interval: 6479ms
  Thread calibration: mean lat.: 1385.679ms, rate sampling interval: 6090ms

-----------------------------------------------------------------------
Test Results @ http://192.168.49.2:30918 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    13.43s     7.87s   32.62s    62.82%
    Req/Sec   107.54      9.29   125.00     81.48%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   12.57s 
 75.000%   19.20s 
 90.000%   24.36s 
 99.000%   32.62s 
 99.900%   35.91s 
 99.990%   38.04s 
 99.999%   38.31s 
100.000%   38.31s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       3.357     0.000000            1         1.00
    3545.087     0.100000         3453         1.11
    5709.823     0.200000         6909         1.25
    8040.447     0.300000        10363         1.43
   10330.111     0.400000        13816         1.67
   12574.719     0.500000        17261         2.00
   13787.135     0.550000        18999         2.22
   15056.895     0.600000        20726         2.50
   16474.111     0.650000        22447         2.86
   17858.559     0.700000        24185         3.33
   19202.047     0.750000        25904         4.00
   19922.943     0.775000        26765         4.44
   20643.839     0.800000        27620         5.00
   21446.655     0.825000        28484         5.71
   22396.927     0.850000        29357         6.67
   23298.047     0.875000        30208         8.00
   23773.183     0.887500        30640         8.89
   24363.007     0.900000        31073        10.00
   24936.447     0.912500        31505        11.43
   25542.655     0.925000        31940        13.33
   26165.247     0.937500        32368        16.00
   26574.847     0.943750        32586        17.78
   27181.055     0.950000        32797        20.00
   27705.343     0.956250        33015        22.86
   28475.391     0.962500        33230        26.67
   29425.663     0.968750        33448        32.00
   29917.183     0.971875        33553        35.56
   30375.935     0.975000        33661        40.00
   30883.839     0.978125        33768        45.71
   31342.591     0.981250        33879        53.33
   31703.039     0.984375        33983        64.00
   31916.031     0.985938        34037        71.11
   32161.791     0.987500        34093        80.00
   32407.551     0.989062        34145        91.43
   32784.383     0.990625        34199       106.67
   33128.447     0.992188        34253       128.00
   33308.671     0.992969        34280       142.22
   33488.895     0.993750        34308       160.00
   33751.039     0.994531        34340       182.86
   33914.879     0.995313        34366       213.33
   34177.023     0.996094        34391       256.00
   34275.327     0.996484        34401       284.44
   34471.935     0.996875        34417       320.00
   34701.311     0.997266        34429       365.71
   34865.151     0.997656        34442       426.67
   35127.295     0.998047        34456       512.00
   35258.367     0.998242        34463       568.89
   35422.207     0.998437        34469       640.00
   35520.511     0.998633        34475       731.43
   35749.887     0.998828        34483       853.33
   35946.495     0.999023        34489      1024.00
   36110.335     0.999121        34492      1137.78
   36274.175     0.999219        34496      1280.00
   36536.319     0.999316        34499      1462.86
   36601.855     0.999414        34502      1706.67
   36765.695     0.999512        34506      2048.00
   36831.231     0.999561        34507      2275.56
   36962.303     0.999609        34509      2560.00
   37158.911     0.999658        34511      2925.71
   37453.823     0.999707        34512      3413.33
   37748.735     0.999756        34514      4096.00
   37879.807     0.999780        34515      4551.11
   37945.343     0.999805        34516      5120.00
   37978.111     0.999829        34517      5851.43
   37978.111     0.999854        34517      6826.67
   38010.879     0.999878        34518      8192.00
   38043.647     0.999890        34520      9102.22
   38043.647     0.999902        34520     10240.00
   38043.647     0.999915        34520     11702.86
   38043.647     0.999927        34520     13653.33
   38043.647     0.999939        34520     16384.00
   38240.255     0.999945        34521     18204.44
   38240.255     0.999951        34521     20480.00
   38240.255     0.999957        34521     23405.71
   38240.255     0.999963        34521     27306.67
   38240.255     0.999969        34521     32768.00
   38305.791     0.999973        34522     36408.89
   38305.791     1.000000        34522          inf
#[Mean    =    13434.265, StdDeviation   =     7872.204]
#[Max     =    38273.024, Total count    =        34522]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  38817 requests in 1.50m, 22.03MB read
Requests/sec:    431.23  
Transfer/sec:    250.63KB